load/k6/results/2026-02-20-ab-proxy.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            18080

Document Path:          /helios_payload.txt
Document Length:        3 bytes

Concurrency Level:      100
Time taken for tests:   5.005 seconds
Complete requests:      10000
Failed requests:        48
   (Connect: 0, Receive: 0, Length: 48, Exceptions: 0)
Non-2xx responses:      48
Keep-Alive requests:    10000
Total transferred:      2119616 bytes
HTML transferred:       30864 bytes
Requests per second:    1998.14 [#/sec] (mean)
Time per request:       50.047 [ms] (mean)
Time per request:       0.500 [ms] (mean, across all concurrent requests)
Transfer rate:          413.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     0   35 363.5      1    5002
Waiting:        0   35 363.5      1    5002
Total:          0   36 363.6      1    5004

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      2
  75%      2
  80%      2
  90%     31
  95%     32
  98%     92
  99%    213
 100%   5004 (longest request)